# AreEqualTo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ICustomFieldProperties..::..AreEqualTo Method
ICustomFieldProperties Interface See Also
---
Identifies if the custom field properties are equal or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
bool AreEqualTo(
	ICustomFieldProperties otherProperties
)
```

Visual Basic
---
```text
Function AreEqualTo ( _
	otherProperties As ICustomFieldProperties _
) As Boolean
```

Visual C++
---
```text
bool AreEqualTo(
	ICustomFieldProperties^ otherProperties
)
```

# ### Parameters
otherProperties
    Type: Autodesk.Revit.DB..::..ICustomFieldProperties The other properties.
# ### Return Value
Returns true if the custom field properties are equal, false otherwise.
# See Also
ICustomFieldProperties Interface
Autodesk.Revit.DB Namespace